In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import squarify

In [2]:
df_dg = pd.read_csv(r"C:\Users\kingd\Downloads\Race and Ethnicity.csv")

In [3]:
df_dg.head()

,ID Race,Race,ID Ethnicity,Ethnicity,ID Year,Year,Hispanic Population Moe,Geography,ID Geography,Slug Geography,Population,share
0,0,White Alone,0,Not Hispanic or Latino,2020,2020,3470.0,"Tampa, FL",16000US1271000,tampa-fl,174700,0.441260
1,0,White Alone,1,Hispanic or Latino,2020,2020,2461.0,"Tampa, FL",16000US1271000,tampa-fl,69207,0.174804
2,1,Black or African American Alone,0,Not Hispanic or Latino,2020,2020,2935.0,"Tampa, FL",16000US1271000,tampa-fl,86493,0.218465
3,1,Black or African American Alone,1,Hispanic or Latino,2020,2020,1122.0,"Tampa, FL",16000US1271000,tampa-fl,5838,0.014746
4,2,American Indian & Alaska Native Alone,0,Not Hispanic or Latino,2020,2020,268.0,"Tampa, FL",16000US1271000,tampa-fl,671,0.001695

In [4]:
df_dg.isnull().sum(axis=0)

ID Race                    0
Race                       0
ID Ethnicity               0
Ethnicity                  0
ID Year                    0
Year                       0
Hispanic Population Moe    0
Geography                  0
ID Geography               0
Slug Geography             0
Population                 0
share                      0
dtype: int64

In [5]:
tampa_gdp = pd.read_csv(r"C:\Users\kingd\Downloads\gdp_tampa.csv")

In [6]:
tampa_gdp.head()

         DATE   NGMP45300
0  2001-01-01   80171.426
1  2002-01-01   85318.547
2  2003-01-01   91144.945
3  2004-01-01   99483.963
4  2005-01-01  107620.219

In [7]:
tampa_gdp.rename(columns={'NGMP45300': 'GDP in the Millions'}, inplace=True)
tampa_gdp['DATE'] = pd.to_datetime(tampa_gdp['DATE'])
tampa_gdp['Year'] = tampa_gdp['DATE'].dt.year
tampa_gdp.isnull().sum(axis=0)

DATE                   0
GDP in the Millions    0
Year                   0
dtype: int64

In [8]:
tampa_gdp.drop('DATE', axis=1, inplace=True)
tampa_gdp.set_index('Year', inplace=True)
tampa_gdp.head()

      GDP in the Millions
Year
2001            80171.426
2002            85318.547
2003            91144.945
2004            99483.963
2005           107620.219

In [9]:
tampa_pop = pd.read_csv(r"C:\Users\kingd\Downloads\tampa_population.csv")
tampa_pop.head()

         date   Population   Annual Change
0  12/31/1950       300000             NaN
1  12/31/1951       323000            7.67
2  12/31/1952       349000            8.05
3  12/31/1953       376000            7.74
4  12/31/1954       405000            7.71

In [10]:
tampa_pop['date'] = pd.to_datetime(tampa_pop['date'])
tampa_pop['date'] = tampa_pop['date'].dt.year
tampa_pop.isnull().sum(axis=0)

date              0
 Population       0
 Annual Change    1
dtype: int64

In [11]:
df2000pop = tampa_pop[tampa_pop['date'] >= 2000]
df2000pop.head()

    date   Population   Annual Change
50  2000      2071000            1.87
51  2001      2106000            1.69
52  2002      2142000            1.71
53  2003      2179000            1.73
54  2004      2216000            1.70

In [23]:
tampa_housing = pd.read_csv(r"C:\Users\kingd\Downloads\tampa-housing.csv")
tampa_housing.rename(columns={'ATNHPIUS45300Q': 'House Price Index'}, inplace=True)
tampa_housing.head()

         DATE  House Price Index
0  1976-04-01              40.33
1  1976-07-01              43.37
2  1976-10-01              43.64
3  1977-01-01              42.07
4  1977-04-01              44.85